#ifndef __Rectangle__
#define __Rectangle__

//------------------------------------------------------------------------------
// Rectangle.h - содержит описание класса прямоугольника,
// порожденного от базового класса Figure
//------------------------------------------------------------------------------

#include "Figure.h"

//------------------------------------------------------------------------------
// прямоугольник
class Rectangle: public Figure
{
    int x, y; // ширина, высота
  public:
    // переопределяем интерфейс класса
    void InData(ifstream &ifst);  // ввод данных из потока
    void Out(ofstream &ofst);     // вывод данных в стандартный поток

    // создание без инициализации.
    Rectangle() {} 
};

#endif
