#ifndef __Triangle__
#define __Triangle__

//------------------------------------------------------------------------------
// Triangle.h - содержит описание класса треугольника,
// порожденного от базового класса Figure
//------------------------------------------------------------------------------

#include "Figure.h"

//------------------------------------------------------------------------------
// треугольник
class Triangle: public Figure
{
    int a, b, c; // стороны
  public:
    // переопределяем интерфейс класса
    void InData(ifstream &ifst);  // ввод данных из потока
    void Out(ofstream &ofst);    // вывод данных в стандартный поток

    // создание без инициализации.
    Triangle() {} 
};
  
#endif
