//------------------------------------------------------------------------------
// Rectangle.cpp - содержит реализацию методов класса Rectangle
//------------------------------------------------------------------------------

#include "Rectangle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника
void Rectangle::InData(ifstream &ifst) {
    ifst >> x >> y;
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника
void Rectangle::Out(ofstream &ofst) {
    ofst << "It is Rectangle: x = " << x << ", y = " << y << endl;
}

//------------------------------------------------------------------------------
// Создание фабрики прямоугольников
namespace {
    RectangleFactory rf;
}
