//------------------------------------------------------------------------------
// Circle.cpp - содержит реализацию методов класса Circle
//------------------------------------------------------------------------------

#include "Circle.h"

//------------------------------------------------------------------------------
// Ввод параметров круга
void Circle::InData(ifstream &ifst) {
    ifst >> r;
}

//------------------------------------------------------------------------------
// Вывод параметров круга
void Circle::Out(ofstream &ofst) {
    ofst << "It is Circle: r = " << r << endl;
}

//------------------------------------------------------------------------------
// Создание фабрики кругов
namespace {
    CircleFactory rf;
}
