#ifndef __Circle__
#define __Circle__

//------------------------------------------------------------------------------
// Circle.h - содержит описание класса круга,
// порожденного от базового класса Figure
//------------------------------------------------------------------------------

#include "Figure.h"

//------------------------------------------------------------------------------
// круг
class Circle: public Figure
{
    int r; // радиус
  public:
    // переопределяем интерфейс класса
    void InData(ifstream &ifst);  // ввод данных из потока
    void Out(ofstream &ofst);     // вывод данных в стандартный поток

    // создание без инициализации.
    Circle() {} 
};

//------------------------------------------------------------------------------
// Фабрика, обеспечивающая создание кругов при чтении признака фигуры
class CircleFactory: public FigureFactory {
public:
    // Конструктор фабрики, устанавливющий признак круга (равен 3)
    CircleFactory():FigureFactory(3) { }
    
    // Переопределение метода Create на создание кругов.
    Figure* Create(int key) {
        if(key == mark)
            return new Circle;
        else
            return nullptr;
    }
};
  
#endif
