//------------------------------------------------------------------------------
// Triangle.cpp - содержит реализацию методов класса Triangle
//------------------------------------------------------------------------------

#include "Triangle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника
void Triangle::InData(ifstream &ifst) {
    ifst >> a >> b >> c;
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника
void Triangle::Out(ofstream &ofst) {
    ofst << "It is Triangle: a = " << a << ", b = " << b 
                       << ", c = " << c << endl;
}

//------------------------------------------------------------------------------
// Создание фабрики треугольников
namespace {
    TriangleFactory tf;
}
